- It is a convention to use SQL queries in all capital letters as it distinguishes it from other code, but it is not a necessary.
- In the below query, we broke the clauses into multiple lines, it is also a conventions but not a requirement

In [5]:
import sqlite3
import pandas as pd

In [6]:
%load_ext sql
%sql sqlite:///./data/nepal.sqlite

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

- Select clause usually says that these are the columns that you need to get data from
- If we need the data from all the columns we put a * 
- Then we need to give the table from which where we need to get these columns from
- It is a convention to keep all the letters of a query syntax capital. It is not required but it helps in distinguishing.
- Another convention is to keep the clauses in different lines. Again this is a convention and not a requirement.

In [7]:
%%sql
SELECT *
FROM sqlite_schema
LIMIT 2

 * sqlite:///./data/nepal.sqlite
Done.

[('table', 'id_map', 'id_map', 2, 'CREATE TABLE "id_map" (\n"household_id" INTEGER,\n  "building_id" INTEGER,\n  "vdcmun_id" INTEGER,\n  "district_id" INTEGER\n)'),
 ('index', 'ix_id_map_household_id', 'id_map', 3, 'CREATE INDEX "ix_id_map_household_id"ON "id_map" ("household_id")')]

In [8]:
%%sql
SELECT name 
FROM sqlite_schema
WHERE type = "table"

 * sqlite:///./data/nepal.sqlite
Done.

[('id_map',),
 ('building_structure',),
 ('building_damage',),
 ('household_demographics',)]

In [9]:
%%sql
SELECT *
FROM id_map
LIMIT 5

 * sqlite:///./data/nepal.sqlite
Done.

[(5601, 56, 7, 1),
 (6301, 63, 7, 1),
 (9701, 97, 7, 1),
 (9901, 99, 7, 1),
 (11501, 115, 7, 1)]